const bmwX3 = 100000;
const fordExplorer = 50000;
const budget = 60000;

let message;
if (budget > bmwX3) {
  message = 'Я хочу купить BMW X3';
} else {
  message = 'Я хочу купить велосипед';
}

const str = 10 > 0 ? console.log('10 > 0') : console.log('10 <= 0');
console.log(str);

console.log(`Я хочу купить ${budget > bmwX3 ? 'BMW' : 'Велосипед'}`);
/*
Проблема выбора между продуктами в зависимости от бюджета
Задача: Рассчитать, какой продукт можно купить в зависимости от имеющегося бюджета. Например, BMW X3 стоит 100 тысяч долларов, а Ford Focus - 10 тысяч.
Использование if-else
При попытке использовать if-else в шаблонных строках возникает ошибка, так как if – это утверждение, не может быть использовано в выражениях.
Пример решения с использованием переменной message для хранения результата, и дальнейшим выводом результата через console.log.
Правильное структурирование кода
Важно корректно использовать скобки в условиях if для определения области действия кода.
Тернарный оператор
Тернарный оператор (условие ? выражение1 : выражение2) позволяет сократить код, делая его более читаемым и позволяет его использовать в шаблонных строках.
Особенность тернарного оператора в том, что он является выражением, возвращающим значение, что позволяет непосредственно присваивать результат его работы переменной или использовать в других выражениях.
Пример использования тернарного оператора
Пример кода, где в зависимости от бюджета выбирается, какой автомобиль купить или рассмотреть велосипед как альтернативу.
Вложенные тернарные операторы
Объяснение возможности использования вложенных тернарных операторов для реализации более сложной логики выбора.
Важно! Вложенные тернарные операторы могут затруднить понимание кода, их использование следует ограничивать ради читаемости.
*/