/* 
Общая Классификация Данных:
Примитивы: Неизменяемые (immutable) данные. Чтобы изменить значение переменной, старое значение полностью заменяется новым.
Объекты: Изменяемые (mutable) структуры данных, представляют собой пары ключ-значение. Значениями могут быть как примитивы, так и другие объекты.

Примитивные Типы Данных:
Числа (Number): В JavaScript не различаются целые числа и числа с плавающей точкой.
Строки (String): Последовательности символов в одинарных, двойных или обратных кавычках.
Булевы Значения (Boolean): Принимают значения true или false.
Undefined: Переменная объявлена, но значение не присвоено.
Null: Значение отсутствует; используется для явного указания на "пустоту".
Symbol: Создаёт уникальные и неизменяемые идентификаторы.
BigInt: Представляет числа, размер которых превышает пределы для типа Number.

Определение Типов:
Для проверки типа значения используется оператор typeof. Применяется как typeof переменная.

Особенности и Рекомендации:
JavaScript является языком с динамической типизацией, тип переменной может изменяться во время выполнения.
Undefined vs Null: undefined обозначает неопределенное значение переменной; null используется для присвоения переменной явного "пустого" значения.
Тип null отображается как object при использовании typeof.
Строки: Обрамляются одинарными, двойными или обратными кавычками.

*/

let a = 5;
let b = 5.6;
console.log(typeof a);
console.log(typeof b);
a = 'строка';
console.log(typeof a);
let isAdmin = a > 10;
console.log(typeof isAdmin);

let c
console.log(typeof c);
c = 5;
console.log(typeof c);

let d = null;
console.log( d == null);