/*
Введение
В программировании операторы равенства позволяют сравнивать значения. Различают нестрогое (==) и строгое (===) равенства.

Примеры и объяснения
Нестрогое равенство (==):

Сравнивает только значения, игнорируя тип данных.
Пример: если secretNumber == 7, выводится "угадал", даже если secretNumber было строкой "7".
Строгое равенство (===):

Сравнивает и значения, и типы данных.
Пример: secretNumber === 7 даст "угадал" только если secretNumber действительно число 7, не строка "7".

Применение
Строгое равенство рекомендуется к использованию, так как оно обеспечивает точность сравнения, требуя совпадения и по значению, и по типу данных.
В случаях, когда требуется сравнение значений разных типов, рекомендуется явное приведение типов. Например, Number(secretNumber) === 7 для сравнения строки "7" и числа 7.
Пример с функцией prompt
Функция prompt в браузере позволяет запросить у пользователя значение. Она возвращает строку, даже если пользователь ввел число.
Для корректной проверки введенного значения на равенство с числом, используйте строгое равенство с приведением строки к числу

*/

const secretNumber = 7;

if (Number(secretNumber === 7)) {
  console.log('Угадал строго');
}

if (secretNumber == 7) {
  console.log('Угадал не строго!');
}

const q = prompt('Введите число');
if (secretNumber == 7) {
  console.log('Угадал не строго!');
}