/*
Цель модуля:
Понимание конвертации значений в Boolean для правильного направления веток кода.

Конвертация в False:
Число 0 и NaN: Прямая конвертация числа 0 в Boolean дает False. Аналогично, результат конвертации "Not a Number" (NaN) также является False.
Пустая строка: Любая строка, если она пуста, при преобразовании в Boolean возвращает False.
Undefined: Неопределенные значения (undefined) автоматически конвертируются в False.
Null: Значение null также интерпретируется как False.

Конвертация в True:
Объекты и массивы, несмотря на содержание, всегда конвертируются в True. Однако, эта тема будет разобрана более подробно позже.

Механизм конвертации:
При выполнении конвертации функцией, сначала происходит выполнение внутренней функции конвертации, затем – внешней. Например, преобразование некорректного значения в число дает NaN, а дальнейшая конвертация NaN в Boolean дает False.
*/

console.log(Boolean(0));
console.log(Boolean(''));
console.log(Boolean(undefined));
console.log(Boolean(null));
console.log(Boolean(Number('sa')));
console.log(Boolean(NaN));