/*
Введение в конвертацию типов

Пример слияния строки и числа как проявление неявной конвертации.
Необходимость в явной конвертации типов для корректных вычислений.

Явная конвертация типов
Пример: преобразование строки с числом в число для корректного сложения.
Использование функции Number() для преобразования строки в число.
Влияние типов операций (сложение, вычитание) на неявное преобразование типов.
Невозможность преобразования некоторых строк в числа, пример с NaN (Not a Number).
Преобразование различных типов в boolean с использованием функции Boolean().

Конвертация строк и чисел
Пример конвертации чисел в строки для получения ожидаемых результатов в сложении строк и чисел.
Boolean конвертация и её результат для разных типов данных: положительных чисел, нуля, непустых и пустых строк.

Полезные практики
Явное использование конвертации типов для избежания ошибок и неоднозначностей в коде.
*/

const age = '18';
console.log(Number(age) + 5);
console.log(age - 3);  
const userName = 'Вася';
console.log(Number(userName) + 5);
console.log(typeof NaN);
console.log(String(4) + 7);
console.log(Boolean(123));

console.log(true + 2);
console.log(a - 10);